src/cf/InformationRegisters/НастройкиОтложенногоНачалаВыполненияДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОтложенногоНачалаВыполненияДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтложенногоСтарта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметДействия</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗапускаДействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УзелОбработки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторДобавленияЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияОзнакомления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СостоянияЗапускаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияЗапускаДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГотовоКСтарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стартовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтартОтменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиОтложенногоНачалаВыполненияДействий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет действие в очередь для отложенного старта
//
// Параметры:
//   Действие - СправочникССылка.ДействияОзнакомления
//   ДатаСтарта - Дата - дата отложенного старта
//   ДобавлениеБезСтарта - Булево - Если Истина, тогда действие будет добавлено в очередь отложенного старта,
//                                  но не будет стартовано (его стояние будет равно 
//                                  Перечисления.СостоянияДействийДляЗапуска.ПустаяСсылка)
//
Процедура Добавить(Действие, ДатаСтарта, ДобавлениеБезСтарта = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиОтложенногоНачалаВыполненияДействий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Действие", Действие);
	
	НачатьТранзакцию();
	
	Попытка
	
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Действие.Установить(Действие);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Действие = Действие;
		Запись.ДатаОтложенногоСтарта = ДатаСтарта;    
		
		РеквДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Действие, "Предмет, УзелОбработки");
		Запись.УзелОбработки = РеквДействия.УзелОбработки;
		Запись.Предмет = РеквДействия.Предмет;   
		
		Запись.АвторДобавленияЗаписи = Сотрудники.ОсновнойСотрудник();
		
		Если Не ДобавлениеБезСтарта Тогда
			Запись.Состояние = Перечисления.СостоянияЗапускаДействий.ГотовоКСтарту;
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Удаляет действие из очереди для фонового старта
//
// Параметры:
//   - Действие - СправочникССылка.ДействияОзнакомления
//
Процедура Удалить(Ознакомление) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиОтложенногоНачалаВыполненияДействий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Действие", Ознакомление);
	
	НачатьТранзакцию();
	
	Попытка
	
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Действие.Установить(Ознакомление);
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Возвращает сведения о запуске для Действие
//
// Параметры:
//   - Действие - СправочникССылка.ДействияОзнакомления
//
// Возвращаемое значение:
//   - Неопределено - Возвращается если сведений нет.
//   - Структура - если есть.
//       - Действие - СправочникССылка.ДействияОзнакомления
//       - ДатаОтложенногоСтарта - ДатаИВремя
//       - Состояние - ПеречислениеСсылка.СостоянияДействийДляЗапуска
//
Функция ПолучитьСведенияОЗапускеДействия(Действие) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(Действие) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействияДляЗапуска.Действие КАК Действие,
		|	ДействияДляЗапуска.ДатаОтложенногоСтарта КАК ДатаОтложенногоСтарта,
		|	ДействияДляЗапуска.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.НастройкиОтложенногоНачалаВыполненияДействий КАК ДействияДляЗапуска
		|ГДЕ
		|	ДействияДляЗапуска.Действие = &Действие";
	Запрос.УстановитьПараметр("Действие", Действие);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура;
		Результат.Вставить("Действие", Выборка.Действие);
		Результат.Вставить("ДатаОтложенногоСтарта", Выборка.ДатаОтложенногоСтарта);
		Результат.Вставить("Состояние", Выборка.Состояние);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Увеличивает счетчик попыток старта действия
//
// Параметры:
//   - Действие - СправочникССылка.ДействияОзнакомления
//
Процедура ЗарегистрироватьПопыткуСтарта(Ознакомление) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УстановитьБезопасныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиОтложенногоНачалаВыполненияДействий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Действие", Ознакомление);
	
	НачатьТранзакцию();
	
	Попытка
	
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Действие.Установить(Ознакомление);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			Запись = НаборЗаписей[0];
			Запись.КоличествоПопытокОбработки = Запись.КоличествоПопытокОбработки + 1;
			НаборЗаписей.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Добавляет сведения об успешном старте действия
//
// Параметры:
//   - Действие - СправочникССылка.ДействияОзнакомления
//
Процедура ЗарегистрироватьСтарт(Ознакомление) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиОтложенногоНачалаВыполненияДействий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Действие", Ознакомление);
	
	НачатьТранзакцию();
	
	Попытка
	
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Действие.Установить(Ознакомление);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей[0].Состояние = Перечисления.СостоянияЗапускаДействий.Стартовано;
			НаборЗаписей.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Добавляет сведенья об отмене старта действия
//
// Параметры:
//   - Действие - СправочникССылка.ДействияОзнакомления
//
Процедура ЗарегистрироватьОтменуСтарта(Ознакомление, ПричинаОтмены) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиОтложенногоНачалаВыполненияДействий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Действие", Ознакомление);
	
	НачатьТранзакцию();
	
	Попытка
	
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Действие.Установить(Ознакомление);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей[0].Состояние = Перечисления.СостоянияЗапускаДействий.СтартОтменен;
			НаборЗаписей[0].ТекстОшибки = ПричинаОтмены;
			НаборЗаписей.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
